Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 120, 18)      0                                            
__________________________________________________________________________________________________
conv1 (Conv1D)                  (None, 116, 10)      910         input_1[0][0]                    
__________________________________________________________________________________________________
pool (MaxPooling1D)             (None, 112, 10)      0           conv1[0][0]                      
__________________________________________________________________________________________________
LSTM (LSTM)                     (None, 112)          55104       pool[0][0]                       
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 500)          56500       LSTM[0][0]                       
__________________________________________________________________________________________________
out_open (Dense)                (None, 15)           7515        dense1[0][0]                     
__________________________________________________________________________________________________
out_high (Dense)                (None, 15)           7515        dense1[0][0]                     
__________________________________________________________________________________________________
out_low (Dense)                 (None, 15)           7515        dense1[0][0]                     
__________________________________________________________________________________________________
out_close (Dense)               (None, 15)           7515        dense1[0][0]                     
__________________________________________________________________________________________________
out_vol (Dense)                 (None, 15)           7515        dense1[0][0]                     
__________________________________________________________________________________________________
out_cat (Dense)                 (None, 15)           7515        dense1[0][0]                     
==================================================================================================
Total params: 157,604
Trainable params: 157,604
Non-trainable params: 0
__________________________________________________________________________________________________

-------------------------------------


Tickers included for training:

['ABBV', 'ABT', 'ALL', 'AMZN', 'BA', 'BABA', 'BAC', 'BMY', 'BP', 'BX', 'CSCO', 'CVX', 'DAL', 'DD', 'DIS', 'EBAY', 'FB', 'GE', 'GPRO', 'HD', 'INTC', 'JD', 'JPM', 'KHC', 'KO', 'KR', 'MRK', 'MSFT', 'MU', 'NWSA', 'ORCL', 'PEP', 'PFE', 'PM', 'PYPL', 'QCOM', 'QQQ', 'SBUX', 'SLB', 'T', 'TNA', 'TWLO', 'TWTR', 'TXN', 'TZA', 'USB', 'V', 'VER', 'VOD', 'VZ', 'WBA', 'WFC', 'WMT', 'WPM', 'WU', 'XOM', 'ZNGA']