Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 120, 7)       0                                            
__________________________________________________________________________________________________
conv1 (Conv1D)                  (None, 111, 8)       568         input_1[0][0]                    
__________________________________________________________________________________________________
conv2 (Conv1D)                  (None, 102, 8)       648         conv1[0][0]                      
__________________________________________________________________________________________________
pool (MaxPooling1D)             (None, 98, 8)        0           conv2[0][0]                      
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 784)          0           pool[0][0]                       
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 1000)         785000      flatten_1[0][0]                  
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 1000)         1001000     dense1[0][0]                     
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1000)         0           dense2[0][0]                     
__________________________________________________________________________________________________
out_open (Dense)                (None, 30)           30030       dropout_1[0][0]                  
__________________________________________________________________________________________________
out_high (Dense)                (None, 30)           30030       dropout_1[0][0]                  
__________________________________________________________________________________________________
out_low (Dense)                 (None, 30)           30030       dropout_1[0][0]                  
__________________________________________________________________________________________________
out_close (Dense)               (None, 30)           30030       dropout_1[0][0]                  
__________________________________________________________________________________________________
out_vol (Dense)                 (None, 30)           30030       dropout_1[0][0]                  
__________________________________________________________________________________________________
out_cat (Dense)                 (None, 30)           30030       dropout_1[0][0]                  
==================================================================================================
Total params: 1,967,396
Trainable params: 1,967,396
Non-trainable params: 0
__________________________________________________________________________________________________

-------------------------------------


Tickers included for training:

['FB', 'MSFT']